# ------------      -------    --------    -----------    -----------
# @File       : 1.4.3 数学四则运算.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 10:01
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

# 实验要求
# Python 可以方便的实现计算器的功能。input()函数做为int()函数的参数，
# 用int(input())可以把输入转为整数，类似，可以用float(input())将输入转为浮点
# 数，round(num, n) 可以把num 近似保留小数点后n 位。数学意义上的加、减、
# 乘、除分别为符号“+、-、*、/”表示。

# 1. 输入两个非零整数，在4 行中按顺序输出两个数的加、减、乘、除的计
# 算结果。
# 输入
# >>>1
# >>>2

# 输出
# 3
# -1
# 2
# 0.5

# 以下为代码区
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 2. 输入两个非零整数，在4行中按顺序输出两个数的加、减、乘、除的计
# 算式和计算结果。要求输出与示例格式相同，符号前后各有一个空格。
# 输入：
# >>>1
# >>>2
# 输出：
# 1 + 2 = 3
# 1 - 2 = -1
# 1 * 2 = 2
# 1 / 2 = 0.5

# 以下为代码区
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 3. 输入两个非零浮点数，在4 行中按顺序输出两个数的加、减、乘、除的
# 计算式和计算结果。计算结果str.format()方法保留小数点后3 位数字。要求输
# 出与示例格式相同，符号前后各有一个空格。例如：
# 输入
# 2.66
# 3.1415926
# 输出
# 2.66 + 3.1415926 = 5.802
# 2.66 - 3.1415926 = -0.482
# 2.66 * 3.1415926 = 8.357
# 2.66 / 3.1415926 = 0.847

# 以下为代码区
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

