# ------------      -------    --------    -----------    -----------
# @File       : 1.4.2 欢迎入学.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 10:01
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

# 实验要求
# 开学了，你考上了武汉理工大学，校园的电子屏上显示着以下欢迎界面：
# |++++++++++++++++++++++|
# |                      |
# |   Welcome to WHUT    |
# |                      |
# |++++++++++++++++++++++|
# 1.请编程输出以上界面

# 以下为代码区
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 2.编写程序，用户入自己的姓名，在上述欢迎界面下输出“欢迎您，***同学！”
# 输入
# >>>李明

# 输出
# |++++++++++++++++++++++|
# |                      |
# |   Welcome to WHUT    |
# |                      |
# |++++++++++++++++++++++|
# 欢迎您，李明同学！

# 以下为代码区
my_name = input()  # 输入学生的姓名
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================
