# ------------      -------    --------    -----------    -----------
# @File       : 10.4.2 金融数据可视化实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/27 23:29
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

import pandas as pd
import mplfinance as mpf
import matplotlib.pyplot as plt


# 设置常量，对应各列数据的语义
Date = 0
HIGH = 1
LOW = 2
OPEN = 3
CLOSE = 4
VOLUME = 5
ADJCLOSE = 6


def read_file(filename):
    """
    @参数 filename: 包含路径的数据文件名，字符串类型
    接收文件名为参数，读取文件中的数据为二维列表，返回列表"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def stock_2020_9(data_list):
    """
    @参数 data_list: 包含股票的数据的二维列表，列表类型
    返回2020年9月1日至9月31日收盘价数据的列表"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_stock(data_list):
    """
    @参数 data_list: 包含股票的数据的二维列表，列表类型
    接收一个列表为参数，根据列表中的数据绘制2020年9月股价变化线型图
    以日期为横坐标，旋转30度显示，股价点用'*'标记。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_volume(data_list):
    """
    @参数 data_list: 包含股票的数据的二维列表，列表类型
    接收一个列表为参数，根据列表中的数据绘制2020年9月每天成交量的柱型图
    以日期为横坐标，旋转30度显示。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_volume_pd(filename):
    """
    @参数 filename: 包含路径的数据文件名，字符串类型
    利用Pandas 对金融数据进行可视化,绘制日成交量的柱型图。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def pd_read_file(filename):
    """读取文件时，将date列读取为index，此时索引类型为obj，将索引类型更改为DatetimeIndex"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_mpf_price(df_data):
    """ mplfinance 绘制股价变化曲线
    df_data为pandas.DataFrame类型，必须包含’Open’, ‘High’, ‘Low’ 和 ‘Close’ 数据
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_mpf_mav(df_data):
    """ df_data为pandas.DataFrame类型，必须包含’Open’, ‘High’, ‘Low’ 和 ‘Close’ 数据"""
    # 增加绘制均线,关键字参数mav = (2, 5, 10)，多条均线使用元组，只绘制一条均线，可以mav = 10；
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_mpf_candle(df_data):
    """ df_data为pandas.DataFrame类型，必须包含’Open’, ‘High’, ‘Low’ 和 ‘Close’ 数据"""
    # 绘制成交量,关键字参数, volume=True
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_mpf_add_plot(df_data):
    """ df_data为pandas.DataFrame类型，必须包含’Open’, ‘High’, ‘Low’ 和 ‘Close’ 数据"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def plot_mpf_charles(df_data):
    """ df_data为pandas.DataFrame类型，必须包含’Open’, ‘High’, ‘Low’ 和 ‘Close’ 数据"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    file = '../data/600132202009.csv'  # 文件名
    stock_in_list = read_file(file)
    df_stock = pd_read_file(file)
    stock_of_2020_9 = stock_2020_9(stock_in_list)

    plot_stock(stock_of_2020_9)
    plot_volume(stock_of_2020_9)
    plot_volume_pd(file)

    plot_mpf_price(df_stock)
    plot_mpf_mav(df_stock)
    plot_mpf_candle(df_stock)
    plot_mpf_add_plot(df_stock)
    plot_mpf_charles(df_stock)
