# ------------      -------    --------    -----------    -----------
# @File       : 2.4.3 绘制中国象棋.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 10:58
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

import turtle as t


def draw_chessboard(x, y):
    """根据画笔初始位置坐标x,y和单元格宽度，绘制棋盘的方格"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_camp():
    """根据画笔初始位置坐标x,y和单元格宽度，绘制棋盘帅营斜线"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def marker(x, y):
    """绘制兵炮标记"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_marker_gun():
    """绘制双方炮位的标记"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_marker_soldier():
    """绘制双方兵卒位的标记"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def piece_circle(radius):
    """绘制棋子的圆，填充为白色"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def piece_font(x, fontColor):
    """接收棋子上的文字和颜色，在棋子写文字"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_boundary(x, y):
    """写楚河汉界的文字"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_piece_soldier(x, y):
    """绘制黑红双方的兵和卒棋子"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_piece_gun(x, y):
    """绘制黑红双方的棋子炮"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def draw_piece_other(x, y):
    """为其他棋子增加文字"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    t.tracer(10)                                 # 取消注释可加速刷新绘制速度
    t.speed(0)                                   # 绘制速度
    t.pensize(2)                                 # 画笔粗线
    width = 60                                   # 设置每格宽度
    t.screensize(10 * width, 12 * width)         # 画布大小为12倍单元格宽度
    pos_of_x, pos_of_y = -4 * width, -4 * width  # 画笔初始坐标
    chess_pieces = [['車', '馬', '相', '仕', '帅', '仕', '相', '馬', '車', '兵', '砲'],
                    ['車', '馬', '象', '士', '将', '士', '象', '馬', '車', '卒', '炮']]
    font_color = ['red', 'green']                # 设置棋子填充色
    draw_chessboard(pos_of_x, pos_of_y)          # 绘制空棋盘
    draw_camp()                                  # 绘制将帅营房
    draw_marker_gun()                            # 绘制炮位标记
    draw_marker_soldier()                        # 绘制兵卒位标记
    draw_boundary(pos_of_x, pos_of_y)            # 绘制楚河汉界
    draw_piece_soldier(pos_of_x, pos_of_y)       # 绘制棋子兵和卒
    draw_piece_gun(pos_of_x, pos_of_y)           # 绘制棋子炮
    draw_piece_other(pos_of_x, pos_of_y)         # 绘制其他棋子
    t.hideturtle()                               # 隐藏画笔
    t.update()                                   # 更新缓存
    t.done()                                     # 结束绘制
