# ------------      -------    --------    -----------    -----------
# @File       : 2.4.1 绘制奥林匹克标志.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 10:31
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

# 奥林匹克标志中五个环的大小、颜色、间距有固定的比例，已知坐标（-110,-25）、（0,-25）、
# （110,-25）、（-55,-75）和（55,-75）为半径为45 的奥运五环的起点，五环的颜色分别是
# red、blue、green、yellow、black，根据给定坐标和颜色绘制奥林匹克标志。

# 以下为代码区
import turtle


# coord_x与coord_y 为五个圆心坐标的x和y值，依顺序可组合成五个点的坐标。
# 以下数据是设半径为45计算而得
coordinate_x = [-110, 0, 110, -55, 55]      # 五个环的绘制起点横坐标，坐标根据半径45的圆计算得到
coordinate_y = [-25, -25, -25, -75, -75]    # 五个环的绘制起点纵坐标，坐标根据半径45的圆计算得到
color_of_circle = ["red", "blue", "green", "yellow", "black"]  # 五个环的颜色turtle.pensize(5)
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================
turtle.hideturtle()    # 隐藏箭头
turtle.done()          # 结束绘制
