# ------------      -------    --------    -----------    -----------
# @File       : 3.4.3 学费计算实验模板.py
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 11:36
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

# 大学第一学期必选课程及其学分如下：
# Python 3 学分
# 高等数学 3 学分
# 大学英语 3 学分
# 大学体育2 学分
# 军事理论 2 学分
# 哲学 2 学分
# 1. 请计算并输出大学第一学期共修多少学分？输入每学分应缴纳的学费，
# 计算并输出第一学期应缴纳多少学费？
# 输入：
# 请输入每学分学费金额：>>>328
# 输出：
# 你本学期选修了17 个学分。
# 你应缴纳的学费为5576 元。

python = 3
math = 4
english = 4
physical_education = 2
military_theory = 2
philosophy = 2
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 2. 大学可以申请助学贷款，申请额度不超过学费和生活费总额的60%，输
# 入你每个月的生活费（浮点数），请计算你每个学期能够贷款多少元？（结果
# 保留小数点后2 位数字，每个学期按5 个月计算）
# 输入：
# 请输入每学分学费金额：>>>328
# 请输入你每个月生活费：>>>1600
# （注：“请输入每学分学费金额：”和“请输入你每个月生活费：”是提示信息，
# 由程序输出，仅328 和1600 是用户输入）
# 输出：
# 本学期你能够贷款8145.60 元

python = 3
math = 4
english = 4
physical_education = 2
military_theory = 2
philosophy = 2
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================
