# ------------      -------    --------    -----------    -----------
# @File       : 3.4.2 地球数据计算实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 11:14
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

# 地球的半径是6371km，假设地球是一个规则的球体，完成以下计算并输出结果，结果保留2 位小数。
# π 值引用math 库中常数PI 的值。
# 1. 计算地球表面积（表面积公式S = 4πR2）
# 2. 计算地球体积（体积公式是V = 4πR3/3）
# 3. 计算地球赤道的周长（圆周长公式是L = 2πR）
# 4. 假设有一根绳子正好可以紧贴地球绕赤道一周，紧密的捆绑住地球。现在将绳子延长1 米，
# 仍围绕地球赤道一周，假设绳子与地球表面间空隙均匀，计算绳子与地球之间的空隙大小。
# 5. 判断一只正常大小的老鼠能否从这个空隙穿过？可假设老鼠身体截面为圆柱，且圆柱最粗处直径为10cm，
# 若空隙大小10cm，输出：“老鼠可以从空隙中钻过”，否则输出：“老鼠无法通过空隙”。
# 根据判定结果进行输出时，可以用if 条件表达式进行判定，满足条件时的输出放在if 分支下的缩进语句块中；
# 不满足条件的输出放在与if 对齐的else 分支下的缩进语句块里。

import math


radius = 6371 * 1000
# 1. 计算地球表面积（表面积公式S = 4πR2）
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================
print(f'地球表面积为{surface_area}平方米')

# 2. 计算地球体积（体积公式是V = 4πR3/3）
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 3. 计算地球赤道的周长（圆周长公式是L = 2πR）
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 4.计算绳子与地球之间的空隙大小
# =======================================================
# 此处去掉注释符号“#”并补充你的代码

# =======================================================

# 5.判断老鼠是否可以从空隙中钻过
# 此处去掉注释符号“#”并补充你的代码
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================
