# ------------      -------    --------    -----------    -----------
# @File       : 4.4.2 个人所得税计算器实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/26 22:11
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

def income_tax():
    """用户输入应发工资薪金所得、五险一金金额和个税免征额，输出应缴税款和实发工资，
    结果保留小数点后两位。当输入数字小于0 或等于0 时，输出“error”。
    实发工资 = 应发工资 - 五险一金 - 个人所得税
    建议使用以下变量名：
    salary：每月应发工资薪金
    insurance_fund：五险一金
    exemption：个税免征额
    educted_amount：速算扣除数
    测试用例
    输入（冒号前是提示性文字，冒号后的数字为用户输入）
    请输入应发工资薪金金额：16000
    请输入五险一金金额：4000
    请输入个税免征额：5000
    输出
    应缴税款490.00 元，实发工资11510.00 元。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    income_tax()              # 调用函数完成计算和输出
