# ------------      -------    --------    -----------    -----------
# @File       : 5.4.1 来自计算机的问候实验模板.py
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/27 8:41
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------
# 代码文档注释中有函数测试数据，直接运行文件时，默认会运行doctest。
# 运行时可点if __name__ == '__main__':旁边的绿三角，运行“5.4.1 来自计算机的问候”
# 或删除文档注释中>>> 开头的行和其下面的输出行
# 1
def print_hi_human():  # 函数名用小写字母
    """文档注释，双引号，说明函数的参数、功能和返回值等。
    定义一个名为print_hi_human的无参数函数，其功能是打印一句问候语，
    这个函数没有return语句，即没有返回值，或者说其返回值为None。
    # >>> print_hi_human()
    # 人类，你好！
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码
    # =======================================================


def say_hi_human():  # 函数名用小写字母
    """无参数函数，其功能是返回字符串“人类，你好！”。
    return语句将函数处理结果返回给调用处，此函数的返回值为一个字符串。
    # >>> say_hi_human()
    # "人类，你好！"
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码
    # =======================================================


def say_hi_person(full_name):  # 函数名用小写字母，函数名填空
    """定义一个名为say_hi_person的有参数函数，其功能是返回一句问候语，
    'full_name，你好！'(full_name为传入的参数)。
    @参数 full_name：人名，字符串类型。
    # >>> say_hi_person('李明')
    # '李明，你好！'
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码
    # =======================================================


def say_hi_gender(full_name, gender):  # name 和gender为形式参数
    """定义一个名为say_hi_gender的有参数函数，其功能是返回一句问候语。
    @参数 full_name：人名，字符串类型
    @参数 gender：性别，字符串类型
    根据参数gender值确定性别称谓，男性称为“先生”，女性称为“女士”，
    gender值不是'男'或'女'时称为“先生/女士”
    返回值为替换了姓名与称谓的欢迎字符串。
    # >>> say_hi_gender('李明', '男')
    # '尊敬的李明先生，欢迎来到火星！'
    # >>> say_hi_gender('王佳', '张亮')
    # '尊敬的王佳先生/女士，欢迎来到火星！'
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码
    # =======================================================


def say_hi_default(full_name, gender='男'):  # name 和gender为形式参数
    """定义一个名为say_hi_default的有参数函数，其功能是返回一句问候语。
    根据性别gender值确定称谓，男性称为“先生”，女性称为“女士”，
    gender值不是'男'或'女'时称为“先生/女士”
    当函数调用时未给出gender时，默认按男性处理
    返回值为替换了姓名与称谓的欢迎字符串
    例如：尊敬的李白先生，欢迎来到火星！
    @参数 full_name：人名，字符串类型
    @参数 gender：默认值参数，字符串类型，表示性别，默认值为'男'
    # >>> say_hi_default(person_name)
    # '尊敬的李明先生，欢迎来到火星！'
    # >>> say_hi_default(person_name, '女')
    # '尊敬的李明女士，欢迎来到火星！'
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码
    # =======================================================


# *加变量名，可接收不限数量的参数
def say_hi_multi_parameter():   # 根据文档注释要求在括号里填合适的参数
    """接收一个不定参数，可接收不限制数量的参数，遍历这个不定参数，分别输出问候语。
    # >>> say_hi_multi_parameter('杜甫', '李白')
    # 杜甫，你好！
    # 李白，你好！
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码
    # =======================================================


if __name__ == '__main__':
    # =======================================================
    # 调用print_hi_human()函数，输出：人类，你好！
    # =======================================================

    # 函数名作为print()函数的参数，输出say_hi_human()的返回值
    # =======================================================
    # 调用say_hi_human()函数，输出：人类，你好！
    # =======================================================

    # 直接使用函数名来调用函数
    person_name = input()              # 输入人名
    # =======================================================
    # 调用say_hi_human()函数，输出：人类，你好！
    # =======================================================

    # 直接使用函数名来调用函数
    person_name = input()               # 输入人名，如输入：李明
    person_gender = input()             # 输入性别，如输入：男
    print(say_hi_gender(person_name, person_gender))  # 调用函数，输出函数的返回值，如：尊敬的李明先生，欢迎来到火星！
    print(say_hi_gender('王佳', '张亮'))  # 输出 尊敬的王佳先生/女士，欢迎来到火星！
    # 直接使用函数名来调用函数
    person_name = input()                     # 输入人名，如输入：李明
    print(say_hi_default(person_name))        # 输出：尊敬的李明先生，欢迎来到火星！
    print(say_hi_default(person_name, '女'))  # 输出：尊敬的李明女士，欢迎来到火星！
    say_hi_multi_parameter('孟浩然')
    say_hi_multi_parameter('杜甫', '李白', '柳宗元', '李商隐')
