# ------------      -------    --------    -----------    -----------
# @File       : 5.4.2 自定义数学函数模块实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/27 9:47
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

def pow(x, n):  # 幂运算函数
    """接收一个数字x和一个整数n为参数,返回x的n次幂的结果的浮点数类型
    要求使pow(1.0, x) 和 pow(x, 0.0) 总是返回 1.0"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================

def gcd(a, b):
    """接收两个正整数为参数，返回两个数的最大公约数"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def lcm(a, b):
    """接收两个正整数为参数，以整数类型返回两个数的最小公倍数"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def fabs(x):
    """返回x的绝对值"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def ceil(x):
    """接受一个浮点数或整数，返回大于或等于该数的最小整数"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def floor(x):
    """接受一个浮点数或整数，返回不大于该数的最大整数"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def factorial(n):
    """接收一个非负整数n为参数，返回n的阶乘，0的阶乘值为1"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def fsum(iterable):
    """接收一个元素为数值的序列为参数，以浮点数类型返回各元素之和"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    print('欢迎使用私人定制的数学库！')