# ------------      -------    --------    -----------    -----------
# @File       : 7.4.2 葡萄酒评论分析报告实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/27 16:38
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

# 1 统计文件中出现的葡萄酒生产国家，输出不重复的国家名列表，按字母
#   表升序排序， 若国家名数据缺失，略过该条数据，返回值中不包含空字符串元素
# 2 计算每个国家的葡萄酒的平均得分，返回值为国家名和得分的列表
# 3 计算每个国家的葡萄酒的平均得分，返回值为国家名和得分的列表，按评分由高到低降序排列
# 4 评分最高的十款葡萄酒的编号、出产国、评分和价格，按评分降序输出
# 5 价格最高的二十款葡萄酒的编号、出产国、评分和价格，按价格降序输出
# 6 统计各个评分的葡萄酒数量是多少？输出包含评分和数量的列表
# 7 输出拥有葡萄酒数量最多的评分和数量
# 8 输出拥有葡萄酒数量最多的评分的葡萄酒的平均价格

import pandas as pd
import math

# 定义符号常量，用于索引，使之具有清晰的语义
NUMBER = 0
COUNTRY = 1
DESCRIPTION = 2
POINTS = 3
PRICE = 4
PROVINCE = 5


def csv_to_ls(file):
    """接收文件名为参数，逐行读取文件中的数据，根据逗号切分每行数据为列表类型，
    作为二维列表的一个元素，返回二维列表。
    @参数 file：文件名，字符串类型
    """
    wine_list = pd.read_csv(file).values.tolist()
    # print(wine_list)
    return wine_list


def country_ls(wine_list):
    """接收列表格式的葡萄酒数据为参数，略过标题行，返回不重复的国家名列表，按字母表升序排序，
    若国家名数据缺失，略过该条数据，返回值中不包含空字符串元素。
    @参数 wine_list：葡萄酒数据，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def avg_point(wine_list, country):
    """接收列表格式的葡萄酒数据和国家名列表为参数，计算每个国家的葡萄酒的平均得分，
    返回值为国家名和得分的列表。
    @参数 wine_list：葡萄酒数据，列表类型
    @参数 country：国家名，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def avg_point_sort(wine_list, country):
    """接收列表格式的葡萄酒数据和国家名列表为参数，计算每个国家的葡萄酒的平均得分，
    返回值为国家名和得分的列表，按评分由高到低降序排列。
    @参数 wine_list：葡萄酒数据，列表类型
    @参数 country：国家名，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================

def top_10_point(wine_list):
    """接收列表格式的葡萄酒数据参数，返回评分最高的十款葡萄酒的编号、出产国、评分和价格，按评
    分降序输出。
    需要注意的是评分可能有缺失值，此时该数据为nan
    if math.isnan(x) == False可用于判定x的值是不是nan
    nan的数据类型是float,不可以直接用字符串判定方法。
    @参数 wine_list：葡萄酒数据，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================

def top_20_price(wine_list):
    """接收列表格式的葡萄酒数据参数，返回价格最高的二十款葡萄酒的编号、出产国、评分和价格，按价
    格降序输出。
    @参数 wine_list：葡萄酒数据，列表类型
    需要注意的是价格可能有缺失值，此时该数据为nan
    if math.isnan(x) == False可用于判定x的值是不是nan
    nan的数据类型是float,不可以直接用字符串判定方法。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def amount_of_point(wine_list):
    """接收列表格式的葡萄酒数据参数，返回每个评分的葡萄酒数量，忽略没有评分的数据
    例如[...[84, 645], [85, 959],...]表示得分为84的葡萄酒645种，得分85的葡萄酒有959种。
    @参数 wine_list：葡萄酒数据，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def most_of_point(amount_of_points):
    """接收每个评分的葡萄酒数量的列表为参数，返回获得该分数数量最多的评分和数量的列表。
    @参数 amount_of_points：每个评分的葡萄酒数量，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def avg_price_of_most_point(wine_list, most_of_points):
    """接收列表格式的葡萄酒数据和获得最多的评分及数量的列表为参数
    忽略缺失价格的数据，返回这个分数的葡萄酒的平均价格，保留2位小数。
    @参数 wine_list：葡萄酒数据，列表类型
    @参数 most_of_points：获得最多的评分及数量，列表类型
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    filename = '../data/winemag-data.csv'
    wine = csv_to_ls(filename)
    Country = country_ls(wine)
    print('国家名列表:')
    print(Country)
    print('每个国家的葡萄酒的平均得分:')
    print(avg_point(wine, Country))
    print('每个国家的葡萄酒的平均得分降序输出:')
    print(avg_point_sort(wine, Country))
    print('评分最高的十款葡萄酒的编号、出产国、评分和价格，按评分降序输出:')
    print(top_10_point(wine))
    print('价格最高的二十款葡萄酒的编号、出产国、评分和价格，按价格降序输出')
    print(top_20_price(wine))
    amount_point = amount_of_point(wine)
    print('各个评分的葡萄酒数量:')
    print(amount_point)
    Most_point = most_of_point(amount_point)
    print('拥有葡萄酒数量最多的评分和数量:')
    print(Most_point)
    print('拥有葡萄酒数量最多的评分的葡萄酒的平均价格:')
    print(avg_price_of_most_point(wine, Most_point))
