# ------------      -------    --------    -----------    -----------
# @File       : 8.4.2 简易英汉字典实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/27 18:27
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

import string


def create_dict(filename):
    """
    @参数 filename：文件名，可包含路径，字符串类型
    读文件中的单词及释义，以单词为键，其他部分为值创建字典，返回值为字典类型。
    多个释义间可能是逗号或空格分隔，但单词与第一个释义间至少有一个空格，将读文件并根据空格切分
    一次，切分结果分别作为键和值创新字典。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def translate(dic, word):
    """
    @参数 dic：根据文件创建的字典，字典类型
    @参数 word：要查询的单词，字符串类型
    接收根据文件创建的字典，从中查询单词word，如果查询单词存在，以元组形式返回词与词的释义；
    单词中包含大写字母时，转为小写字母查询。
    如果查询不存在，返回'这个词我不明白'。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def sentence_to_words():
    """调用此函数时，先输出提示信息'请输入查询的句子：'
    用户输入欲查询翻译的句子，若直接输入回车时，输出'查询结束，正在退出...'。
    输入非空时，先将"n't"替换为 ' not'、"'s"替换为 ' is'，再将标点符号替换为空格。
    根据空格将句子切分为单词的列表，调用translate逐个单词进行翻译。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def translate_word():
    """调用此函数时，先输出提示信息：'请输入查询的单词：'
    用户可循环输入欲查询翻译的单词，若直接输入回车时，输出'查询结束，正在退出...'。
    输入非空时输出翻译结果。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    file = './data/dict.txt'  # 文件名
    word_dic = create_dict(file)  # 调用函数返回字典类型的数据
    print('载入字典数据成功！查询单词请输入“1”，查询句子请输入“2”')
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================
