# ------------      -------    --------    -----------    -----------
# @File       : 9.4.2 批量文件处理与格式转换实验模板.py    
# @Contact    : vasp@qq.com
# @Copyright  : 2018-2025, Wuhan University of Technology
# @Modify Time: 2021/4/27 22:30
# @Author     : 赵广辉
# @Version    : 1.0
# @License    : 仅限用于Python程序设计基础实践教程(赵广辉,高等教育出版社)配套实验
# ------------      -------    --------    -----------    -----------

import os
import json


def filename_list(path):
    """
    @参数 path：路径，字符串
    接收路径字符串为参数，获取该路径下所有文件名，以列表形式返回
    os.listdir(path)以列表形式返回path路径下的所有文件名，不包括子路径中的文件名。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def read_title(file):
    """
    @参数 file： 文件名，字符串
    接收文件名为参数，读取文件第一行为二维列表格式
    文件第一行为：Date,High,Low,Open,Close,Volume,Adj Close
    列表格式为：[['Stock code', 'Date', 'High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close']]
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def read_file(file):
    """
    @参数 file： 文件名，字符串
    接收文件名为参数，略过文件第一行，读取文件内容为二维列表格式
    将主文件名部分以字符串类型加入，作为每个列表元素第一个元素
    如文件名为：600000.csv
    如文件的一行为： 2010-01-04,9.049530029296875,8.75574016571045,9.032979965209961,
    8.768150329589844,159964607.0,5.441317081451416
    列表格式为：['600000', 2010-01-04,9.049530029296875,8.75574016571045,9.032979965209961,
    8.768150329589844,159964607.0,5.441317081451416]
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def merge_data(path, name_list):
    """
    @参数 path：csv文件所在路径，字符串
    @参数 name_list：文件名的列表，列表类型
    将stock下所有csv文件中的数据合并到一个列表中，返回值为列表。
    列表第一个元素为['Stock code', 'Date', 'High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close']
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def list_to_dict(merge_list):
    """
    @参数 merge_list：包含合并数据的列表，列表类型
    接收包含数据的列表，将其转为字典类型，列表第一个元素中的值分别作为键。
    返回值为元素为字典的列表。
    """
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


def dict_to_json(list_of_dict, filename):
    """
    @参数 list_of_dict：元素为字典的列表，列表类型
    @参数 filename：准备创建的json文件名，字符串
    接收元素为字典类型的列表和准备创建的json文件名为参数
    将数据转为json格式写入文件，缩进4字符，保持中文原样输出"""
    # =======================================================
    # 此处去掉注释符号“#”并补充你的代码

    # =======================================================


if __name__ == '__main__':
    filepath = '../data/stock/'  # 文件名
    stock_list = []
    stock_code_list = filename_list(filepath)
    merge_csv_list = merge_data(filepath, stock_code_list)
    merge_csv_dict = list_to_dict(merge_csv_list)
    file_in_json = '../data/stock.json'  # 合并后的json路径与名称
    dict_to_json(merge_csv_dict, file_in_json)
